Repository: MatBonnin/AnguCart
Catalog: src/locale/messages.*.xlf
Languages: fr

# CancelButton
source: Delete
fr: Supprimer

# UpdateDeck
source: Update my deck
fr: Mettre à jour mon deck

# deckFormLabelName:
source: Deck name:
fr: Nom du deck :

# LoginLabel
source: Login
fr: Connexion

# RegisterLabel
source: Register
fr: Inscription

# NameInputLabel
source: Name: <input type="text" formControlName="name" />
fr: Nom : <input type="text" formControlName="name" />

# ValueInputLabel
source: Value: <input type="number" formControlName="value" />
fr: Valeur <input type="number" formControlName="value" />

# SubmitAddButton
source: Add
fr: Ajouter

# deckFormTitle
source: Create a new deck
fr: Créer un nouveau deck

# deckFormLabelName
source: Deck name:
fr: Nom du deck :

# deckFormErrorName
source: Please enter a name for your deck.
fr: Entrer un nom de deck :

source: Select cards:
fr: Selectionner une card :

# deckFormCardValue
source: Value: {{ card.value }}
fr: Valeur: {{ card.value }}

# deckFormErrorSelectCards
source: Please select at least one card for your deck.
fr: Selectionner au moins une carte pour votre deck :

# deckFormErrorMaxCards
source: Maximum number of cards reached.
fr: Nombre maximum de carte atteint :

# deckFormButton
source: Create deck
fr: Créer le deck

# SelectDeckTitle
source: Choose a deck:
fr: Choisir un deck :

# SelectDeckButton
source: Select
fr: Selectionner

# PlayerScoreLabel
source: Player: {{ playerScore }}
fr: Joueur: {{ playerScore }}

# ComputerScoreLabel
source: Computer: {{ computerScore }}
fr: Ordinateur: {{ computerScore }}

# PlayerCardLabel
source: Player's card
fr: Carte du joueur

# ComputerCardLabel
source: Computer's card
fr: Carte de l'ordinateur

# ResetGameButton
source: Reset
fr: Recommencer

# PlayerDeckLabel
source: My deck: {{ playerDeck?.name }}
fr: Mon deck: {{ playerDeck?.name }}

source: Card
fr: Carte

source: Display
fr: Afficher

source: Create
fr: Créer

source: Play
fr: Jouer
